RhinoInside.Revit API Documentation
GeometryDecoder.ToPolyCurves Method
 Converts the specified CurveArrArray to an equivalent PolyCurve array.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Rhino.Geometry.PolyCurve[] ToPolyCurves(
	this Autodesk.Revit.DB.CurveArrArray value
)
@staticmethod
def ToPolyCurves(
	value: Autodesk.Revit.DB.CurveArrArray
) -> Rhino.Geometry.PolyCurve[]
Parameters
value
Type: Autodesk.Revit.DB.CurveArrArray
A value to convert.
Return Value
Type: Rhino.Geometry.PolyCurve[]
A Rhino PolyCurve array that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.CurveArrArray. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace